GopalSaraf/Practicals/PSDL/include/proc/pic18f4585.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F4585_INC_
#define _PIC18F4585_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F4585
 */

/*
 * Device Registers
 */

// Register: RXF6SIDH
#define RXF6SIDH RXF6SIDH
RXF6SIDH                                 equ 0D60h
// bitfield definitions
RXF6SIDH_SID3_POSN                       equ 0000h
RXF6SIDH_SID3_POSITION                   equ 0000h
RXF6SIDH_SID3_SIZE                       equ 0001h
RXF6SIDH_SID3_LENGTH                     equ 0001h
RXF6SIDH_SID3_MASK                       equ 0001h
RXF6SIDH_SID4_POSN                       equ 0001h
RXF6SIDH_SID4_POSITION                   equ 0001h
RXF6SIDH_SID4_SIZE                       equ 0001h
RXF6SIDH_SID4_LENGTH                     equ 0001h
RXF6SIDH_SID4_MASK                       equ 0002h
RXF6SIDH_SID5_POSN                       equ 0002h
RXF6SIDH_SID5_POSITION                   equ 0002h
RXF6SIDH_SID5_SIZE                       equ 0001h
RXF6SIDH_SID5_LENGTH                     equ 0001h
RXF6SIDH_SID5_MASK                       equ 0004h
RXF6SIDH_SID6_POSN                       equ 0003h
RXF6SIDH_SID6_POSITION                   equ 0003h
RXF6SIDH_SID6_SIZE                       equ 0001h
RXF6SIDH_SID6_LENGTH                     equ 0001h
RXF6SIDH_SID6_MASK                       equ 0008h
RXF6SIDH_SID7_POSN                       equ 0004h
RXF6SIDH_SID7_POSITION                   equ 0004h
RXF6SIDH_SID7_SIZE                       equ 0001h
RXF6SIDH_SID7_LENGTH                     equ 0001h
RXF6SIDH_SID7_MASK                       equ 0010h
RXF6SIDH_SID8_POSN                       equ 0005h
RXF6SIDH_SID8_POSITION                   equ 0005h
RXF6SIDH_SID8_SIZE                       equ 0001h
RXF6SIDH_SID8_LENGTH                     equ 0001h
RXF6SIDH_SID8_MASK                       equ 0020h
RXF6SIDH_SID9_POSN                       equ 0006h
RXF6SIDH_SID9_POSITION                   equ 0006h
RXF6SIDH_SID9_SIZE                       equ 0001h
RXF6SIDH_SID9_LENGTH                     equ 0001h
RXF6SIDH_SID9_MASK                       equ 0040h
RXF6SIDH_SID10_POSN                      equ 0007h
RXF6SIDH_SID10_POSITION                  equ 0007h
RXF6SIDH_SID10_SIZE                      equ 0001h
RXF6SIDH_SID10_LENGTH                    equ 0001h
RXF6SIDH_SID10_MASK                      equ 0080h
RXF6SIDH_RXF6SID3_POSN                   equ 0000h
RXF6SIDH_RXF6SID3_POSITION               equ 0000h
RXF6SIDH_RXF6SID3_SIZE                   equ 0001h
RXF6SIDH_RXF6SID3_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID3_MASK                   equ 0001h
RXF6SIDH_RXF6SID4_POSN                   equ 0001h
RXF6SIDH_RXF6SID4_POSITION               equ 0001h
RXF6SIDH_RXF6SID4_SIZE                   equ 0001h
RXF6SIDH_RXF6SID4_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID4_MASK                   equ 0002h
RXF6SIDH_RXF6SID5_POSN                   equ 0002h
RXF6SIDH_RXF6SID5_POSITION               equ 0002h
RXF6SIDH_RXF6SID5_SIZE                   equ 0001h
RXF6SIDH_RXF6SID5_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID5_MASK                   equ 0004h
RXF6SIDH_RXF6SID6_POSN                   equ 0003h
RXF6SIDH_RXF6SID6_POSITION               equ 0003h
RXF6SIDH_RXF6SID6_SIZE                   equ 0001h
RXF6SIDH_RXF6SID6_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID6_MASK                   equ 0008h
RXF6SIDH_RXF6SID7_POSN                   equ 0004h
RXF6SIDH_RXF6SID7_POSITION               equ 0004h
RXF6SIDH_RXF6SID7_SIZE                   equ 0001h
RXF6SIDH_RXF6SID7_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID7_MASK                   equ 0010h
RXF6SIDH_RXF6SID8_POSN                   equ 0005h
RXF6SIDH_RXF6SID8_POSITION               equ 0005h
RXF6SIDH_RXF6SID8_SIZE                   equ 0001h
RXF6SIDH_RXF6SID8_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID8_MASK                   equ 0020h
RXF6SIDH_RXF6SID9_POSN                   equ 0006h
RXF6SIDH_RXF6SID9_POSITION               equ 0006h
RXF6SIDH_RXF6SID9_SIZE                   equ 0001h
RXF6SIDH_RXF6SID9_LENGTH                 equ 0001h
RXF6SIDH_RXF6SID9_MASK                   equ 0040h
RXF6SIDH_RXF6SID10_POSN                  equ 0007h
RXF6SIDH_RXF6SID10_POSITION              equ 0007h
RXF6SIDH_RXF6SID10_SIZE                  equ 0001h
RXF6SIDH_RXF6SID10_LENGTH                equ 0001h
RXF6SIDH_RXF6SID10_MASK                  equ 0080h

// Register: RXF6SIDL
#define RXF6SIDL RXF6SIDL
RXF6SIDL                                 equ 0D61h
// bitfield definitions
RXF6SIDL_EID16_POSN                      equ 0000h
RXF6SIDL_EID16_POSITION                  equ 0000h
RXF6SIDL_EID16_SIZE                      equ 0001h
RXF6SIDL_EID16_LENGTH                    equ 0001h
RXF6SIDL_EID16_MASK                      equ 0001h
RXF6SIDL_EID17_POSN                      equ 0001h
RXF6SIDL_EID17_POSITION                  equ 0001h
RXF6SIDL_EID17_SIZE                      equ 0001h
RXF6SIDL_EID17_LENGTH                    equ 0001h
RXF6SIDL_EID17_MASK                      equ 0002h
RXF6SIDL_EXIDEN_POSN                     equ 0003h
RXF6SIDL_EXIDEN_POSITION                 equ 0003h
RXF6SIDL_EXIDEN_SIZE                     equ 0001h
RXF6SIDL_EXIDEN_LENGTH                   equ 0001h
RXF6SIDL_EXIDEN_MASK                     equ 0008h
RXF6SIDL_SID0_POSN                       equ 0005h
RXF6SIDL_SID0_POSITION                   equ 0005h
RXF6SIDL_SID0_SIZE                       equ 0001h
RXF6SIDL_SID0_LENGTH                     equ 0001h
RXF6SIDL_SID0_MASK                       equ 0020h
RXF6SIDL_SID1_POSN                       equ 0006h
RXF6SIDL_SID1_POSITION                   equ 0006h
RXF6SIDL_SID1_SIZE                       equ 0001h
RXF6SIDL_SID1_LENGTH                     equ 0001h
RXF6SIDL_SID1_MASK                       equ 0040h
RXF6SIDL_SID2_POSN                       equ 0007h
RXF6SIDL_SID2_POSITION                   equ 0007h
RXF6SIDL_SID2_SIZE                       equ 0001h
RXF6SIDL_SID2_LENGTH                     equ 0001h
RXF6SIDL_SID2_MASK                       equ 0080h
RXF6SIDL_EXIDE_POSN                      equ 0003h
RXF6SIDL_EXIDE_POSITION                  equ 0003h
RXF6SIDL_EXIDE_SIZE                      equ 0001h
RXF6SIDL_EXIDE_LENGTH                    equ 0001h
RXF6SIDL_EXIDE_MASK                      equ 0008h
RXF6SIDL_RXF6EID16_POSN                  equ 0000h
RXF6SIDL_RXF6EID16_POSITION              equ 0000h
RXF6SIDL_RXF6EID16_SIZE                  equ 0001h
RXF6SIDL_RXF6EID16_LENGTH                equ 0001h
RXF6SIDL_RXF6EID16_MASK                  equ 0001h
RXF6SIDL_RXF6EID17_POSN                  equ 0001h
RXF6SIDL_RXF6EID17_POSITION              equ 0001h
RXF6SIDL_RXF6EID17_SIZE                  equ 0001h
RXF6SIDL_RXF6EID17_LENGTH                equ 0001h
RXF6SIDL_RXF6EID17_MASK                  equ 0002h
RXF6SIDL_RXF6EXIDEN_POSN                 equ 0003h
RXF6SIDL_RXF6EXIDEN_POSITION             equ 0003h
RXF6SIDL_RXF6EXIDEN_SIZE                 equ 0001h
RXF6SIDL_RXF6EXIDEN_LENGTH               equ 0001h
RXF6SIDL_RXF6EXIDEN_MASK                 equ 0008h
RXF6SIDL_RXF6SID0_POSN                   equ 0005h
RXF6SIDL_RXF6SID0_POSITION               equ 0005h
RXF6SIDL_RXF6SID0_SIZE                   equ 0001h
RXF6SIDL_RXF6SID0_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID0_MASK                   equ 0020h
RXF6SIDL_RXF6SID1_POSN                   equ 0006h
RXF6SIDL_RXF6SID1_POSITION               equ 0006h
RXF6SIDL_RXF6SID1_SIZE                   equ 0001h
RXF6SIDL_RXF6SID1_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID1_MASK                   equ 0040h
RXF6SIDL_RXF6SID2_POSN                   equ 0007h
RXF6SIDL_RXF6SID2_POSITION               equ 0007h
RXF6SIDL_RXF6SID2_SIZE                   equ 0001h
RXF6SIDL_RXF6SID2_LENGTH                 equ 0001h
RXF6SIDL_RXF6SID2_MASK                   equ 0080h

// Register: RXF6EIDH
#define RXF6EIDH RXF6EIDH
RXF6EIDH                                 equ 0D62h
// bitfield definitions
RXF6EIDH_EID8_POSN                       equ 0000h
RXF6EIDH_EID8_POSITION                   equ 0000h
RXF6EIDH_EID8_SIZE                       equ 0001h
RXF6EIDH_EID8_LENGTH                     equ 0001h
RXF6EIDH_EID8_MASK                       equ 0001h
RXF6EIDH_EID9_POSN                       equ 0001h
RXF6EIDH_EID9_POSITION                   equ 0001h
RXF6EIDH_EID9_SIZE                       equ 0001h
RXF6EIDH_EID9_LENGTH                     equ 0001h
RXF6EIDH_EID9_MASK                       equ 0002h
RXF6EIDH_EID10_POSN                      equ 0002h
RXF6EIDH_EID10_POSITION                  equ 0002h
RXF6EIDH_EID10_SIZE                      equ 0001h
RXF6EIDH_EID10_LENGTH                    equ 0001h
RXF6EIDH_EID10_MASK                      equ 0004h
RXF6EIDH_EID11_POSN                      equ 0003h
RXF6EIDH_EID11_POSITION                  equ 0003h
RXF6EIDH_EID11_SIZE                      equ 0001h
RXF6EIDH_EID11_LENGTH                    equ 0001h
RXF6EIDH_EID11_MASK                      equ 0008h
RXF6EIDH_EID12_POSN                      equ 0004h
RXF6EIDH_EID12_POSITION                  equ 0004h
RXF6EIDH_EID12_SIZE                      equ 0001h
RXF6EIDH_EID12_LENGTH                    equ 0001h
RXF6EIDH_EID12_MASK                      equ 0010h
RXF6EIDH_EID13_POSN                      equ 0005h
RXF6EIDH_EID13_POSITION                  equ 0005h
RXF6EIDH_EID13_SIZE                      equ 0001h
RXF6EIDH_EID13_LENGTH                    equ 0001h
RXF6EIDH_EID13_MASK                      equ 0020h
RXF6EIDH_EID14_POSN                      equ 0006h
RXF6EIDH_EID14_POSITION                  equ 0006h
RXF6EIDH_EID14_SIZE                      equ 0001h
RXF6EIDH_EID14_LENGTH                    equ 0001h
RXF6EIDH_EID14_MASK                      equ 0040h
RXF6EIDH_EID15_POSN                      equ 0007h
RXF6EIDH_EID15_POSITION                  equ 0007h
RXF6EIDH_EID15_SIZE                      equ 0001h
RXF6EIDH_EID15_LENGTH                    equ 0001h
RXF6EIDH_EID15_MASK                      equ 0080h
RXF6EIDH_RXF6EID8_POSN                   equ 0000h
RXF6EIDH_RXF6EID8_POSITION               equ 0000h
RXF6EIDH_RXF6EID8_SIZE                   equ 0001h
RXF6EIDH_RXF6EID8_LENGTH                 equ 0001h
RXF6EIDH_RXF6EID8_MASK                   equ 0001h
RXF6EIDH_RXF6EID9_POSN                   equ 0001h
RXF6EIDH_RXF6EID9_POSITION               equ 0001h
RXF6EIDH_RXF6EID9_SIZE                   equ 0001h
RXF6EIDH_RXF6EID9_LENGTH                 equ 0001h
RXF6EIDH_RXF6EID9_MASK                   equ 0002h
RXF6EIDH_RXF6EID10_POSN                  equ 0002h
RXF6EIDH_RXF6EID10_POSITION              equ 0002h
RXF6EIDH_RXF6EID10_SIZE                  equ 0001h
RXF6EIDH_RXF6EID10_LENGTH                equ 0001h
RXF6EIDH_RXF6EID10_MASK                  equ 0004h
RXF6EIDH_RXF6EID11_POSN                  equ 0003h
RXF6EIDH_RXF6EID11_POSITION              equ 0003h
RXF6EIDH_RXF6EID11_SIZE                  equ 0001h
RXF6EIDH_RXF6EID11_LENGTH                equ 0001h
RXF6EIDH_RXF6EID11_MASK                  equ 0008h
RXF6EIDH_RXF6EID12_POSN                  equ 0004h
RXF6EIDH_RXF6EID12_POSITION              equ 0004h
RXF6EIDH_RXF6EID12_SIZE                  equ 0001h
RXF6EIDH_RXF6EID12_LENGTH                equ 0001h
RXF6EIDH_RXF6EID12_MASK                  equ 0010h
RXF6EIDH_RXF6EID13_POSN                  equ 0005h
RXF6EIDH_RXF6EID13_POSITION              equ 0005h
RXF6EIDH_RXF6EID13_SIZE                  equ 0001h
RXF6EIDH_RXF6EID13_LENGTH                equ 0001h
RXF6EIDH_RXF6EID13_MASK                  equ 0020h
RXF6EIDH_RXF6EID14_POSN                  equ 0006h
RXF6EIDH_RXF6EID14_POSITION              equ 0006h
RXF6EIDH_RXF6EID14_SIZE                  equ 0001h
RXF6EIDH_RXF6EID14_LENGTH                equ 0001h
RXF6EIDH_RXF6EID14_MASK                  equ 0040h
RXF6EIDH_RXF6EID15_POSN                  equ 0007h
RXF6EIDH_RXF6EID15_POSITION              equ 0007h
RXF6EIDH_RXF6EID15_SIZE                  equ 0001h
RXF6EIDH_RXF6EID15_LENGTH                equ 0001h
RXF6EIDH_RXF6EID15_MASK                  equ 0080h

// Register: RXF6EIDL
#define RXF6EIDL RXF6EIDL
RXF6EIDL                                 equ 0D63h
// bitfield definitions
RXF6EIDL_EID0_POSN                       equ 0000h
RXF6EIDL_EID0_POSITION                   equ 0000h
RXF6EIDL_EID0_SIZE                       equ 0001h
RXF6EIDL_EID0_LENGTH                     equ 0001h
RXF6EIDL_EID0_MASK                       equ 0001h
RXF6EIDL_EID1_POSN                       equ 0001h
RXF6EIDL_EID1_POSITION                   equ 0001h
RXF6EIDL_EID1_SIZE                       equ 0001h
RXF6EIDL_EID1_LENGTH                     equ 0001h
RXF6EIDL_EID1_MASK                       equ 0002h
RXF6EIDL_EID2_POSN                       equ 0002h
RXF6EIDL_EID2_POSITION                   equ 0002h
RXF6EIDL_EID2_SIZE                       equ 0001h
RXF6EIDL_EID2_LENGTH                     equ 0001h
RXF6EIDL_EID2_MASK                       equ 0004h
RXF6EIDL_EID3_POSN                       equ 0003h
RXF6EIDL_EID3_POSITION                   equ 0003h
RXF6EIDL_EID3_SIZE                       equ 0001h
RXF6EIDL_EID3_LENGTH                     equ 0001h
RXF6EIDL_EID3_MASK                       equ 0008h
RXF6EIDL_EID4_POSN                       equ 0004h
RXF6EIDL_EID4_POSITION                   equ 0004h
RXF6EIDL_EID4_SIZE                       equ 0001h
RXF6EIDL_EID4_LENGTH                     equ 0001h
RXF6EIDL_EID4_MASK                       equ 0010h
RXF6EIDL_EID5_POSN                       equ 0005h
RXF6EIDL_EID5_POSITION                   equ 0005h
RXF6EIDL_EID5_SIZE                       equ 0001h
RXF6EIDL_EID5_LENGTH                     equ 0001h
RXF6EIDL_EID5_MASK                       equ 0020h
RXF6EIDL_EID6_POSN                       equ 0006h
RXF6EIDL_EID6_POSITION                   equ 0006h
RXF6EIDL_EID6_SIZE                       equ 0001h
RXF6EIDL_EID6_LENGTH                     equ 0001h
RXF6EIDL_EID6_MASK                       equ 0040h
RXF6EIDL_EID7_POSN                       equ 0007h
RXF6EIDL_EID7_POSITION                   equ 0007h
RXF6EIDL_EID7_SIZE                       equ 0001h
RXF6EIDL_EID7_LENGTH                     equ 0001h
RXF6EIDL_EID7_MASK                       equ 0080h
RXF6EIDL_RXF6EID0_POSN                   equ 0000h
RXF6EIDL_RXF6EID0_POSITION               equ 0000h
RXF6EIDL_RXF6EID0_SIZE                   equ 0001h
RXF6EIDL_RXF6EID0_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID0_MASK                   equ 0001h
RXF6EIDL_RXF6EID1_POSN                   equ 0001h
RXF6EIDL_RXF6EID1_POSITION               equ 0001h
RXF6EIDL_RXF6EID1_SIZE                   equ 0001h
RXF6EIDL_RXF6EID1_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID1_MASK                   equ 0002h
RXF6EIDL_RXF6EID2_POSN                   equ 0002h
RXF6EIDL_RXF6EID2_POSITION               equ 0002h
RXF6EIDL_RXF6EID2_SIZE                   equ 0001h
RXF6EIDL_RXF6EID2_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID2_MASK                   equ 0004h
RXF6EIDL_RXF6EID3_POSN                   equ 0003h
RXF6EIDL_RXF6EID3_POSITION               equ 0003h
RXF6EIDL_RXF6EID3_SIZE                   equ 0001h
RXF6EIDL_RXF6EID3_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID3_MASK                   equ 0008h
RXF6EIDL_RXF6EID4_POSN                   equ 0004h
RXF6EIDL_RXF6EID4_POSITION               equ 0004h
RXF6EIDL_RXF6EID4_SIZE                   equ 0001h
RXF6EIDL_RXF6EID4_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID4_MASK                   equ 0010h
RXF6EIDL_RXF6EID5_POSN                   equ 0005h
RXF6EIDL_RXF6EID5_POSITION               equ 0005h
RXF6EIDL_RXF6EID5_SIZE                   equ 0001h
RXF6EIDL_RXF6EID5_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID5_MASK                   equ 0020h
RXF6EIDL_RXF6EID6_POSN                   equ 0006h
RXF6EIDL_RXF6EID6_POSITION               equ 0006h
RXF6EIDL_RXF6EID6_SIZE                   equ 0001h
RXF6EIDL_RXF6EID6_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID6_MASK                   equ 0040h
RXF6EIDL_RXF6EID7_POSN                   equ 0007h
RXF6EIDL_RXF6EID7_POSITION               equ 0007h
RXF6EIDL_RXF6EID7_SIZE                   equ 0001h
RXF6EIDL_RXF6EID7_LENGTH                 equ 0001h
RXF6EIDL_RXF6EID7_MASK                   equ 0080h

