GopalSaraf/Practicals/PSDL/include/proc/pic18f4585.inc
// Register: TXBIE
#define TXBIE TXBIE
TXBIE                                    equ 0DFCh
// bitfield definitions
TXBIE_TXB0IE_POSN                        equ 0002h
TXBIE_TXB0IE_POSITION                    equ 0002h
TXBIE_TXB0IE_SIZE                        equ 0001h
TXBIE_TXB0IE_LENGTH                      equ 0001h
TXBIE_TXB0IE_MASK                        equ 0004h
TXBIE_TXB1IE_POSN                        equ 0003h
TXBIE_TXB1IE_POSITION                    equ 0003h
TXBIE_TXB1IE_SIZE                        equ 0001h
TXBIE_TXB1IE_LENGTH                      equ 0001h
TXBIE_TXB1IE_MASK                        equ 0008h
TXBIE_TXB2IE_POSN                        equ 0004h
TXBIE_TXB2IE_POSITION                    equ 0004h
TXBIE_TXB2IE_SIZE                        equ 0001h
TXBIE_TXB2IE_LENGTH                      equ 0001h
TXBIE_TXB2IE_MASK                        equ 0010h
TXBIE_TX0IE_POSN                         equ 0002h
TXBIE_TX0IE_POSITION                     equ 0002h
TXBIE_TX0IE_SIZE                         equ 0001h
TXBIE_TX0IE_LENGTH                       equ 0001h
TXBIE_TX0IE_MASK                         equ 0004h
TXBIE_TX1IE_POSN                         equ 0003h
TXBIE_TX1IE_POSITION                     equ 0003h
TXBIE_TX1IE_SIZE                         equ 0001h
TXBIE_TX1IE_LENGTH                       equ 0001h
TXBIE_TX1IE_MASK                         equ 0008h
TXBIE_TX2IE_POSN                         equ 0004h
TXBIE_TX2IE_POSITION                     equ 0004h
TXBIE_TX2IE_SIZE                         equ 0001h
TXBIE_TX2IE_LENGTH                       equ 0001h
TXBIE_TX2IE_MASK                         equ 0010h

// Register: B0CON
#define B0CON B0CON
B0CON                                    equ 0E20h
// bitfield definitions
B0CON_FILHIT0_TXPRI0_POSN                equ 0000h
B0CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B0CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B0CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B0CON_FILHIT0_TXPRI0_MASK                equ 0001h
B0CON_FILHIT1_TXPRI1_POSN                equ 0001h
B0CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B0CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B0CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B0CON_FILHIT1_TXPRI1_MASK                equ 0002h
B0CON_FILHIT2_RTREN_POSN                 equ 0002h
B0CON_FILHIT2_RTREN_POSITION             equ 0002h
B0CON_FILHIT2_RTREN_SIZE                 equ 0001h
B0CON_FILHIT2_RTREN_LENGTH               equ 0001h
B0CON_FILHIT2_RTREN_MASK                 equ 0004h
B0CON_FILHIT3_TXREQ_POSN                 equ 0003h
B0CON_FILHIT3_TXREQ_POSITION             equ 0003h
B0CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B0CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B0CON_FILHIT3_TXREQ_MASK                 equ 0008h
B0CON_FILHIT4_TXERR_POSN                 equ 0004h
B0CON_FILHIT4_TXERR_POSITION             equ 0004h
B0CON_FILHIT4_TXERR_SIZE                 equ 0001h
B0CON_FILHIT4_TXERR_LENGTH               equ 0001h
B0CON_FILHIT4_TXERR_MASK                 equ 0010h
B0CON_RXRTRRO_TXLARB_POSN                equ 0005h
B0CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B0CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B0CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B0CON_RXRTRRO_TXLARB_MASK                equ 0020h
B0CON_RXM1_TXABT_POSN                    equ 0006h
B0CON_RXM1_TXABT_POSITION                equ 0006h
B0CON_RXM1_TXABT_SIZE                    equ 0001h
B0CON_RXM1_TXABT_LENGTH                  equ 0001h
B0CON_RXM1_TXABT_MASK                    equ 0040h
B0CON_RXFUL_TXBIF_POSN                   equ 0007h
B0CON_RXFUL_TXBIF_POSITION               equ 0007h
B0CON_RXFUL_TXBIF_SIZE                   equ 0001h
B0CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B0CON_RXFUL_TXBIF_MASK                   equ 0080h
B0CON_FILHIT0_POSN                       equ 0000h
B0CON_FILHIT0_POSITION                   equ 0000h
B0CON_FILHIT0_SIZE                       equ 0001h
B0CON_FILHIT0_LENGTH                     equ 0001h
B0CON_FILHIT0_MASK                       equ 0001h
B0CON_FILHIT1_POSN                       equ 0001h
B0CON_FILHIT1_POSITION                   equ 0001h
B0CON_FILHIT1_SIZE                       equ 0001h
B0CON_FILHIT1_LENGTH                     equ 0001h
B0CON_FILHIT1_MASK                       equ 0002h
B0CON_FILHIT2_POSN                       equ 0002h
B0CON_FILHIT2_POSITION                   equ 0002h
B0CON_FILHIT2_SIZE                       equ 0001h
B0CON_FILHIT2_LENGTH                     equ 0001h
B0CON_FILHIT2_MASK                       equ 0004h
B0CON_FILHIT3_POSN                       equ 0003h
B0CON_FILHIT3_POSITION                   equ 0003h
B0CON_FILHIT3_SIZE                       equ 0001h
B0CON_FILHIT3_LENGTH                     equ 0001h
B0CON_FILHIT3_MASK                       equ 0008h
B0CON_FILHIT4_POSN                       equ 0004h
B0CON_FILHIT4_POSITION                   equ 0004h
B0CON_FILHIT4_SIZE                       equ 0001h
B0CON_FILHIT4_LENGTH                     equ 0001h
B0CON_FILHIT4_MASK                       equ 0010h
B0CON_RTRRO_POSN                         equ 0005h
B0CON_RTRRO_POSITION                     equ 0005h
B0CON_RTRRO_SIZE                         equ 0001h
B0CON_RTRRO_LENGTH                       equ 0001h
B0CON_RTRRO_MASK                         equ 0020h
B0CON_RXM1_POSN                          equ 0006h
B0CON_RXM1_POSITION                      equ 0006h
B0CON_RXM1_SIZE                          equ 0001h
B0CON_RXM1_LENGTH                        equ 0001h
B0CON_RXM1_MASK                          equ 0040h
B0CON_RXFUL_POSN                         equ 0007h
B0CON_RXFUL_POSITION                     equ 0007h
B0CON_RXFUL_SIZE                         equ 0001h
B0CON_RXFUL_LENGTH                       equ 0001h
B0CON_RXFUL_MASK                         equ 0080h
B0CON_TXPRI0_POSN                        equ 0000h
B0CON_TXPRI0_POSITION                    equ 0000h
B0CON_TXPRI0_SIZE                        equ 0001h
B0CON_TXPRI0_LENGTH                      equ 0001h
B0CON_TXPRI0_MASK                        equ 0001h
B0CON_TXPRI1_POSN                        equ 0001h
B0CON_TXPRI1_POSITION                    equ 0001h
B0CON_TXPRI1_SIZE                        equ 0001h
B0CON_TXPRI1_LENGTH                      equ 0001h
B0CON_TXPRI1_MASK                        equ 0002h
B0CON_RTREN_POSN                         equ 0002h
B0CON_RTREN_POSITION                     equ 0002h
B0CON_RTREN_SIZE                         equ 0001h
B0CON_RTREN_LENGTH                       equ 0001h
B0CON_RTREN_MASK                         equ 0004h
B0CON_TXREQ_POSN                         equ 0003h
B0CON_TXREQ_POSITION                     equ 0003h
B0CON_TXREQ_SIZE                         equ 0001h
B0CON_TXREQ_LENGTH                       equ 0001h
B0CON_TXREQ_MASK                         equ 0008h
B0CON_TXERR_POSN                         equ 0004h
B0CON_TXERR_POSITION                     equ 0004h
B0CON_TXERR_SIZE                         equ 0001h
B0CON_TXERR_LENGTH                       equ 0001h
B0CON_TXERR_MASK                         equ 0010h
B0CON_TXLARB_POSN                        equ 0005h
B0CON_TXLARB_POSITION                    equ 0005h
B0CON_TXLARB_SIZE                        equ 0001h
B0CON_TXLARB_LENGTH                      equ 0001h
B0CON_TXLARB_MASK                        equ 0020h
B0CON_TXABT_POSN                         equ 0006h
B0CON_TXABT_POSITION                     equ 0006h
B0CON_TXABT_SIZE                         equ 0001h
B0CON_TXABT_LENGTH                       equ 0001h
B0CON_TXABT_MASK                         equ 0040h
B0CON_TXBIF_POSN                         equ 0007h
B0CON_TXBIF_POSITION                     equ 0007h
B0CON_TXBIF_SIZE                         equ 0001h
B0CON_TXBIF_LENGTH                       equ 0001h
B0CON_TXBIF_MASK                         equ 0080h
B0CON_RXRTRRO_POSN                       equ 0005h
B0CON_RXRTRRO_POSITION                   equ 0005h
B0CON_RXRTRRO_SIZE                       equ 0001h
B0CON_RXRTRRO_LENGTH                     equ 0001h
B0CON_RXRTRRO_MASK                       equ 0020h
B0CON_B0FILHIT0_POSN                     equ 0000h
B0CON_B0FILHIT0_POSITION                 equ 0000h
B0CON_B0FILHIT0_SIZE                     equ 0001h
B0CON_B0FILHIT0_LENGTH                   equ 0001h
B0CON_B0FILHIT0_MASK                     equ 0001h
B0CON_B0FILHIT1_POSN                     equ 0001h
B0CON_B0FILHIT1_POSITION                 equ 0001h
B0CON_B0FILHIT1_SIZE                     equ 0001h
B0CON_B0FILHIT1_LENGTH                   equ 0001h
B0CON_B0FILHIT1_MASK                     equ 0002h
B0CON_B0FILHIT2_POSN                     equ 0002h
B0CON_B0FILHIT2_POSITION                 equ 0002h
B0CON_B0FILHIT2_SIZE                     equ 0001h
B0CON_B0FILHIT2_LENGTH                   equ 0001h
B0CON_B0FILHIT2_MASK                     equ 0004h
B0CON_B0FILHIT3_POSN                     equ 0003h
B0CON_B0FILHIT3_POSITION                 equ 0003h
B0CON_B0FILHIT3_SIZE                     equ 0001h
B0CON_B0FILHIT3_LENGTH                   equ 0001h
B0CON_B0FILHIT3_MASK                     equ 0008h
B0CON_B0FILHIT4_POSN                     equ 0004h
B0CON_B0FILHIT4_POSITION                 equ 0004h
B0CON_B0FILHIT4_SIZE                     equ 0001h
B0CON_B0FILHIT4_LENGTH                   equ 0001h
B0CON_B0FILHIT4_MASK                     equ 0010h
B0CON_B0RTRRO_POSN                       equ 0005h
B0CON_B0RTRRO_POSITION                   equ 0005h
B0CON_B0RTRRO_SIZE                       equ 0001h
B0CON_B0RTRRO_LENGTH                     equ 0001h
B0CON_B0RTRRO_MASK                       equ 0020h
B0CON_B0RXM1_POSN                        equ 0006h
B0CON_B0RXM1_POSITION                    equ 0006h
B0CON_B0RXM1_SIZE                        equ 0001h
B0CON_B0RXM1_LENGTH                      equ 0001h
B0CON_B0RXM1_MASK                        equ 0040h
B0CON_B0RXFUL_POSN                       equ 0007h
B0CON_B0RXFUL_POSITION                   equ 0007h
B0CON_B0RXFUL_SIZE                       equ 0001h
B0CON_B0RXFUL_LENGTH                     equ 0001h
B0CON_B0RXFUL_MASK                       equ 0080h
B0CON_B0TXPRI0_POSN                      equ 0000h
B0CON_B0TXPRI0_POSITION                  equ 0000h
B0CON_B0TXPRI0_SIZE                      equ 0001h
B0CON_B0TXPRI0_LENGTH                    equ 0001h
B0CON_B0TXPRI0_MASK                      equ 0001h
B0CON_B0TXPRI1_POSN                      equ 0001h
B0CON_B0TXPRI1_POSITION                  equ 0001h
B0CON_B0TXPRI1_SIZE                      equ 0001h
B0CON_B0TXPRI1_LENGTH                    equ 0001h
B0CON_B0TXPRI1_MASK                      equ 0002h
B0CON_B0RTREN_POSN                       equ 0002h
B0CON_B0RTREN_POSITION                   equ 0002h
B0CON_B0RTREN_SIZE                       equ 0001h
B0CON_B0RTREN_LENGTH                     equ 0001h
B0CON_B0RTREN_MASK                       equ 0004h
B0CON_B0TXREQ_POSN                       equ 0003h
B0CON_B0TXREQ_POSITION                   equ 0003h
B0CON_B0TXREQ_SIZE                       equ 0001h
B0CON_B0TXREQ_LENGTH                     equ 0001h
B0CON_B0TXREQ_MASK                       equ 0008h
B0CON_B0TXERR_POSN                       equ 0004h
B0CON_B0TXERR_POSITION                   equ 0004h
B0CON_B0TXERR_SIZE                       equ 0001h
B0CON_B0TXERR_LENGTH                     equ 0001h
B0CON_B0TXERR_MASK                       equ 0010h
B0CON_B0TXLARB_POSN                      equ 0005h
B0CON_B0TXLARB_POSITION                  equ 0005h
B0CON_B0TXLARB_SIZE                      equ 0001h
B0CON_B0TXLARB_LENGTH                    equ 0001h
B0CON_B0TXLARB_MASK                      equ 0020h
B0CON_B0TXABT_POSN                       equ 0006h
B0CON_B0TXABT_POSITION                   equ 0006h
B0CON_B0TXABT_SIZE                       equ 0001h
B0CON_B0TXABT_LENGTH                     equ 0001h
B0CON_B0TXABT_MASK                       equ 0040h
B0CON_B0TXB3IF_POSN                      equ 0007h
B0CON_B0TXB3IF_POSITION                  equ 0007h
B0CON_B0TXB3IF_SIZE                      equ 0001h
B0CON_B0TXB3IF_LENGTH                    equ 0001h
B0CON_B0TXB3IF_MASK                      equ 0080h

// Register: B0SIDH
#define B0SIDH B0SIDH
B0SIDH                                   equ 0E21h
// bitfield definitions
B0SIDH_SID3_POSN                         equ 0000h
B0SIDH_SID3_POSITION                     equ 0000h
B0SIDH_SID3_SIZE                         equ 0001h
B0SIDH_SID3_LENGTH                       equ 0001h
B0SIDH_SID3_MASK                         equ 0001h
B0SIDH_SID4_POSN                         equ 0001h
B0SIDH_SID4_POSITION                     equ 0001h
B0SIDH_SID4_SIZE                         equ 0001h
B0SIDH_SID4_LENGTH                       equ 0001h
B0SIDH_SID4_MASK                         equ 0002h
B0SIDH_SID5_POSN                         equ 0002h
B0SIDH_SID5_POSITION                     equ 0002h
B0SIDH_SID5_SIZE                         equ 0001h
B0SIDH_SID5_LENGTH                       equ 0001h
B0SIDH_SID5_MASK                         equ 0004h
B0SIDH_SID6_POSN                         equ 0003h
B0SIDH_SID6_POSITION                     equ 0003h
B0SIDH_SID6_SIZE                         equ 0001h
B0SIDH_SID6_LENGTH                       equ 0001h
B0SIDH_SID6_MASK                         equ 0008h
B0SIDH_SID7_POSN                         equ 0004h
B0SIDH_SID7_POSITION                     equ 0004h
B0SIDH_SID7_SIZE                         equ 0001h
B0SIDH_SID7_LENGTH                       equ 0001h
B0SIDH_SID7_MASK                         equ 0010h
B0SIDH_SID8_POSN                         equ 0005h
B0SIDH_SID8_POSITION                     equ 0005h
B0SIDH_SID8_SIZE                         equ 0001h
B0SIDH_SID8_LENGTH                       equ 0001h
B0SIDH_SID8_MASK                         equ 0020h
B0SIDH_SID9_POSN                         equ 0006h
B0SIDH_SID9_POSITION                     equ 0006h
B0SIDH_SID9_SIZE                         equ 0001h
B0SIDH_SID9_LENGTH                       equ 0001h
B0SIDH_SID9_MASK                         equ 0040h
B0SIDH_SID10_POSN                        equ 0007h
B0SIDH_SID10_POSITION                    equ 0007h
B0SIDH_SID10_SIZE                        equ 0001h
B0SIDH_SID10_LENGTH                      equ 0001h
B0SIDH_SID10_MASK                        equ 0080h
B0SIDH_B0SID3_POSN                       equ 0000h
B0SIDH_B0SID3_POSITION                   equ 0000h
B0SIDH_B0SID3_SIZE                       equ 0001h
B0SIDH_B0SID3_LENGTH                     equ 0001h
B0SIDH_B0SID3_MASK                       equ 0001h
B0SIDH_B0SID4_POSN                       equ 0001h
B0SIDH_B0SID4_POSITION                   equ 0001h
B0SIDH_B0SID4_SIZE                       equ 0001h
B0SIDH_B0SID4_LENGTH                     equ 0001h
B0SIDH_B0SID4_MASK                       equ 0002h
B0SIDH_B0SID5_POSN                       equ 0002h
B0SIDH_B0SID5_POSITION                   equ 0002h
B0SIDH_B0SID5_SIZE                       equ 0001h
B0SIDH_B0SID5_LENGTH                     equ 0001h
B0SIDH_B0SID5_MASK                       equ 0004h
B0SIDH_B0SID6_POSN                       equ 0003h
B0SIDH_B0SID6_POSITION                   equ 0003h
B0SIDH_B0SID6_SIZE                       equ 0001h
B0SIDH_B0SID6_LENGTH                     equ 0001h
B0SIDH_B0SID6_MASK                       equ 0008h
B0SIDH_B0SID7_POSN                       equ 0004h
B0SIDH_B0SID7_POSITION                   equ 0004h
B0SIDH_B0SID7_SIZE                       equ 0001h
B0SIDH_B0SID7_LENGTH                     equ 0001h
B0SIDH_B0SID7_MASK                       equ 0010h
B0SIDH_B0SID8_POSN                       equ 0005h
B0SIDH_B0SID8_POSITION                   equ 0005h
B0SIDH_B0SID8_SIZE                       equ 0001h
B0SIDH_B0SID8_LENGTH                     equ 0001h
B0SIDH_B0SID8_MASK                       equ 0020h
B0SIDH_B0SID9_POSN                       equ 0006h
B0SIDH_B0SID9_POSITION                   equ 0006h
B0SIDH_B0SID9_SIZE                       equ 0001h
B0SIDH_B0SID9_LENGTH                     equ 0001h
B0SIDH_B0SID9_MASK                       equ 0040h
B0SIDH_B0SID10_POSN                      equ 0007h
B0SIDH_B0SID10_POSITION                  equ 0007h
B0SIDH_B0SID10_SIZE                      equ 0001h
B0SIDH_B0SID10_LENGTH                    equ 0001h
B0SIDH_B0SID10_MASK                      equ 0080h

