GopalSaraf/Practicals/PSDL/include/proc/pic18f4585.inc
#define B2DLC2                           BANKMASK(B2DLC), 2, b
#define B2DLC3                           BANKMASK(B2DLC), 3, b
#define B2EID0                           BANKMASK(B2EIDL), 0, b
#define B2EID1                           BANKMASK(B2EIDL), 1, b
#define B2EID10                          BANKMASK(B2EIDH), 2, b
#define B2EID11                          BANKMASK(B2EIDH), 3, b
#define B2EID12                          BANKMASK(B2EIDH), 4, b
#define B2EID13                          BANKMASK(B2EIDH), 5, b
#define B2EID14                          BANKMASK(B2EIDH), 6, b
#define B2EID15                          BANKMASK(B2EIDH), 7, b
#define B2EID16                          BANKMASK(B2SIDL), 0, b
#define B2EID17                          BANKMASK(B2SIDL), 1, b
#define B2EID2                           BANKMASK(B2EIDL), 2, b
#define B2EID3                           BANKMASK(B2EIDL), 3, b
#define B2EID4                           BANKMASK(B2EIDL), 4, b
#define B2EID5                           BANKMASK(B2EIDL), 5, b
#define B2EID6                           BANKMASK(B2EIDL), 6, b
#define B2EID7                           BANKMASK(B2EIDL), 7, b
#define B2EID8                           BANKMASK(B2EIDH), 0, b
#define B2EID9                           BANKMASK(B2EIDH), 1, b
#define B2EXID                           BANKMASK(B2SIDL), 3, b
#define B2EXIDE                          BANKMASK(B2SIDL), 3, b
#define B2FILHIT0                        BANKMASK(B2CON), 0, b
#define B2FILHIT1                        BANKMASK(B2CON), 1, b
#define B2FILHIT2                        BANKMASK(B2CON), 2, b
#define B2FILHIT3                        BANKMASK(B2CON), 3, b
#define B2FILHIT4                        BANKMASK(B2CON), 4, b
#define B2IE                             BANKMASK(BIE0), 4, b
#define B2RB0                            BANKMASK(B2DLC), 4, b
#define B2RB1                            BANKMASK(B2DLC), 5, b
#define B2RTREN                          BANKMASK(B2CON), 2, b
#define B2RTRRO                          BANKMASK(B2CON), 5, b
#define B2RXFUL                          BANKMASK(B2CON), 7, b
#define B2RXM1                           BANKMASK(B2CON), 6, b
#define B2RXRTR                          BANKMASK(B2DLC), 6, b
#define B2SID0                           BANKMASK(B2SIDL), 5, b
#define B2SID1                           BANKMASK(B2SIDL), 6, b
#define B2SID10                          BANKMASK(B2SIDH), 7, b
#define B2SID2                           BANKMASK(B2SIDL), 7, b
#define B2SID3                           BANKMASK(B2SIDH), 0, b
#define B2SID4                           BANKMASK(B2SIDH), 1, b
#define B2SID5                           BANKMASK(B2SIDH), 2, b
#define B2SID6                           BANKMASK(B2SIDH), 3, b
#define B2SID7                           BANKMASK(B2SIDH), 4, b
#define B2SID8                           BANKMASK(B2SIDH), 5, b
#define B2SID9                           BANKMASK(B2SIDH), 6, b
#define B2SRR                            BANKMASK(B2SIDL), 4, b
#define B2TXABT                          BANKMASK(B2CON), 6, b
#define B2TXB3IF                         BANKMASK(B2CON), 7, b
#define B2TXEN                           BANKMASK(BSEL0), 4, b
#define B2TXERR                          BANKMASK(B2CON), 4, b
#define B2TXLARB                         BANKMASK(B2CON), 5, b
#define B2TXPRI0                         BANKMASK(B2CON), 0, b
#define B2TXPRI1                         BANKMASK(B2CON), 1, b
#define B2TXREQ                          BANKMASK(B2CON), 3, b
#define B3D00                            BANKMASK(B3D0), 0, b
#define B3D01                            BANKMASK(B3D0), 1, b
#define B3D02                            BANKMASK(B3D0), 2, b
#define B3D03                            BANKMASK(B3D0), 3, b
#define B3D04                            BANKMASK(B3D0), 4, b
#define B3D05                            BANKMASK(B3D0), 5, b
#define B3D06                            BANKMASK(B3D0), 6, b
#define B3D07                            BANKMASK(B3D0), 7, b
#define B3D10                            BANKMASK(B3D1), 0, b
#define B3D11                            BANKMASK(B3D1), 1, b
#define B3D12                            BANKMASK(B3D1), 2, b
#define B3D13                            BANKMASK(B3D1), 3, b
#define B3D14                            BANKMASK(B3D1), 4, b
#define B3D15                            BANKMASK(B3D1), 5, b
#define B3D16                            BANKMASK(B3D1), 6, b
#define B3D17                            BANKMASK(B3D1), 7, b
#define B3D20                            BANKMASK(B3D2), 0, b
#define B3D21                            BANKMASK(B3D2), 1, b
#define B3D22                            BANKMASK(B3D2), 2, b
#define B3D23                            BANKMASK(B3D2), 3, b
#define B3D24                            BANKMASK(B3D2), 4, b
#define B3D25                            BANKMASK(B3D2), 5, b
#define B3D26                            BANKMASK(B3D2), 6, b
#define B3D27                            BANKMASK(B3D2), 7, b
#define B3D30                            BANKMASK(B3D3), 0, b
#define B3D31                            BANKMASK(B3D3), 1, b
#define B3D32                            BANKMASK(B3D3), 2, b
#define B3D33                            BANKMASK(B3D3), 3, b
#define B3D34                            BANKMASK(B3D3), 4, b
#define B3D35                            BANKMASK(B3D3), 5, b
#define B3D36                            BANKMASK(B3D3), 6, b
#define B3D37                            BANKMASK(B3D3), 7, b
#define B3D40                            BANKMASK(B3D4), 0, b
#define B3D41                            BANKMASK(B3D4), 1, b
#define B3D42                            BANKMASK(B3D4), 2, b
#define B3D43                            BANKMASK(B3D4), 3, b
#define B3D44                            BANKMASK(B3D4), 4, b
#define B3D45                            BANKMASK(B3D4), 5, b
#define B3D46                            BANKMASK(B3D4), 6, b
#define B3D47                            BANKMASK(B3D4), 7, b
#define B3D50                            BANKMASK(B3D5), 0, b
#define B3D51                            BANKMASK(B3D5), 1, b
#define B3D52                            BANKMASK(B3D5), 2, b
#define B3D53                            BANKMASK(B3D5), 3, b
#define B3D54                            BANKMASK(B3D5), 4, b
#define B3D55                            BANKMASK(B3D5), 5, b
#define B3D56                            BANKMASK(B3D5), 6, b
#define B3D57                            BANKMASK(B3D5), 7, b
#define B3D60                            BANKMASK(B3D6), 0, b
#define B3D61                            BANKMASK(B3D6), 1, b
#define B3D62                            BANKMASK(B3D6), 2, b
#define B3D63                            BANKMASK(B3D6), 3, b
#define B3D64                            BANKMASK(B3D6), 4, b
#define B3D65                            BANKMASK(B3D6), 5, b
#define B3D66                            BANKMASK(B3D6), 6, b
#define B3D67                            BANKMASK(B3D6), 7, b
#define B3D70                            BANKMASK(B3D7), 0, b
#define B3D71                            BANKMASK(B3D7), 1, b
#define B3D72                            BANKMASK(B3D7), 2, b
#define B3D73                            BANKMASK(B3D7), 3, b
#define B3D74                            BANKMASK(B3D7), 4, b
#define B3D75                            BANKMASK(B3D7), 5, b
#define B3D76                            BANKMASK(B3D7), 6, b
#define B3D77                            BANKMASK(B3D7), 7, b
#define B3DLC0                           BANKMASK(B3DLC), 0, b
#define B3DLC1                           BANKMASK(B3DLC), 1, b
#define B3DLC2                           BANKMASK(B3DLC), 2, b
#define B3DLC3                           BANKMASK(B3DLC), 3, b
#define B3EID0                           BANKMASK(B3EIDL), 0, b
#define B3EID1                           BANKMASK(B3EIDL), 1, b
#define B3EID10                          BANKMASK(B3EIDH), 2, b
#define B3EID11                          BANKMASK(B3EIDH), 3, b
#define B3EID12                          BANKMASK(B3EIDH), 4, b
#define B3EID13                          BANKMASK(B3EIDH), 5, b
#define B3EID14                          BANKMASK(B3EIDH), 6, b
#define B3EID15                          BANKMASK(B3EIDH), 7, b
#define B3EID16                          BANKMASK(B3SIDL), 0, b
#define B3EID17                          BANKMASK(B3SIDL), 1, b
#define B3EID2                           BANKMASK(B3EIDL), 2, b
#define B3EID3                           BANKMASK(B3EIDL), 3, b
#define B3EID4                           BANKMASK(B3EIDL), 4, b
#define B3EID5                           BANKMASK(B3EIDL), 5, b
#define B3EID6                           BANKMASK(B3EIDL), 6, b
#define B3EID7                           BANKMASK(B3EIDL), 7, b
#define B3EID8                           BANKMASK(B3EIDH), 0, b
#define B3EID9                           BANKMASK(B3EIDH), 1, b
#define B3EXID                           BANKMASK(B3SIDL), 3, b
#define B3EXIDE                          BANKMASK(B3SIDL), 3, b
#define B3FILHIT0                        BANKMASK(B3CON), 0, b
#define B3FILHIT1                        BANKMASK(B3CON), 1, b
#define B3FILHIT2                        BANKMASK(B3CON), 2, b
#define B3FILHIT3                        BANKMASK(B3CON), 3, b
#define B3FILHIT4                        BANKMASK(B3CON), 4, b
#define B3IE                             BANKMASK(BIE0), 5, b
#define B3RB0                            BANKMASK(B3DLC), 4, b
#define B3RB1                            BANKMASK(B3DLC), 5, b
#define B3RTREN                          BANKMASK(B3CON), 2, b
#define B3RTRRO                          BANKMASK(B3CON), 5, b
#define B3RXFUL                          BANKMASK(B3CON), 7, b
#define B3RXM1                           BANKMASK(B3CON), 6, b
#define B3RXRTR                          BANKMASK(B3DLC), 6, b
#define B3SID0                           BANKMASK(B3SIDL), 5, b
#define B3SID1                           BANKMASK(B3SIDL), 6, b
#define B3SID10                          BANKMASK(B3SIDH), 7, b
#define B3SID2                           BANKMASK(B3SIDL), 7, b
#define B3SID3                           BANKMASK(B3SIDH), 0, b
#define B3SID4                           BANKMASK(B3SIDH), 1, b
#define B3SID5                           BANKMASK(B3SIDH), 2, b
#define B3SID6                           BANKMASK(B3SIDH), 3, b
#define B3SID7                           BANKMASK(B3SIDH), 4, b
#define B3SID8                           BANKMASK(B3SIDH), 5, b
#define B3SID9                           BANKMASK(B3SIDH), 6, b
#define B3SRR                            BANKMASK(B3SIDL), 4, b
#define B3TXABT                          BANKMASK(B3CON), 6, b
#define B3TXB3IF                         BANKMASK(B3CON), 7, b
#define B3TXEN                           BANKMASK(BSEL0), 5, b
#define B3TXERR                          BANKMASK(B3CON), 4, b
#define B3TXLARB                         BANKMASK(B3CON), 5, b
#define B3TXPRI0                         BANKMASK(B3CON), 0, b
#define B3TXPRI1                         BANKMASK(B3CON), 1, b
#define B3TXREQ                          BANKMASK(B3CON), 3, b
#define B46D77                           BANKMASK(B4D7), 7, b
#define B4D00                            BANKMASK(B4D0), 0, b
#define B4D01                            BANKMASK(B4D0), 1, b
#define B4D02                            BANKMASK(B4D0), 2, b
#define B4D03                            BANKMASK(B4D0), 3, b
#define B4D04                            BANKMASK(B4D0), 4, b
#define B4D05                            BANKMASK(B4D0), 5, b
#define B4D06                            BANKMASK(B4D0), 6, b
#define B4D07                            BANKMASK(B4D0), 7, b
#define B4D10                            BANKMASK(B4D1), 0, b
#define B4D11                            BANKMASK(B4D1), 1, b
#define B4D12                            BANKMASK(B4D1), 2, b
#define B4D13                            BANKMASK(B4D1), 3, b
#define B4D14                            BANKMASK(B4D1), 4, b
#define B4D15                            BANKMASK(B4D1), 5, b
#define B4D16                            BANKMASK(B4D1), 6, b
#define B4D17                            BANKMASK(B4D1), 7, b
#define B4D20                            BANKMASK(B4D2), 0, b
#define B4D21                            BANKMASK(B4D2), 1, b
#define B4D22                            BANKMASK(B4D2), 2, b
#define B4D23                            BANKMASK(B4D2), 3, b
#define B4D24                            BANKMASK(B4D2), 4, b
#define B4D25                            BANKMASK(B4D2), 5, b
#define B4D26                            BANKMASK(B4D2), 6, b
#define B4D27                            BANKMASK(B4D2), 7, b
#define B4D30                            BANKMASK(B4D3), 0, b
#define B4D31                            BANKMASK(B4D3), 1, b
#define B4D32                            BANKMASK(B4D3), 2, b
#define B4D33                            BANKMASK(B4D3), 3, b
#define B4D34                            BANKMASK(B4D3), 4, b
#define B4D35                            BANKMASK(B4D3), 5, b
#define B4D36                            BANKMASK(B4D3), 6, b
#define B4D37                            BANKMASK(B4D3), 7, b
#define B4D40                            BANKMASK(B4D4), 0, b
#define B4D41                            BANKMASK(B4D4), 1, b
#define B4D42                            BANKMASK(B4D4), 2, b
#define B4D43                            BANKMASK(B4D4), 3, b
#define B4D44                            BANKMASK(B4D4), 4, b
#define B4D45                            BANKMASK(B4D4), 5, b
#define B4D46                            BANKMASK(B4D4), 6, b
#define B4D47                            BANKMASK(B4D4), 7, b
#define B4D50                            BANKMASK(B4D5), 0, b
#define B4D51                            BANKMASK(B4D5), 1, b
#define B4D52                            BANKMASK(B4D5), 2, b
#define B4D53                            BANKMASK(B4D5), 3, b
#define B4D54                            BANKMASK(B4D5), 4, b
#define B4D55                            BANKMASK(B4D5), 5, b
#define B4D56                            BANKMASK(B4D5), 6, b
#define B4D57                            BANKMASK(B4D5), 7, b
#define B4D60                            BANKMASK(B4D6), 0, b
#define B4D61                            BANKMASK(B4D6), 1, b
#define B4D62                            BANKMASK(B4D6), 2, b
#define B4D63                            BANKMASK(B4D6), 3, b
#define B4D64                            BANKMASK(B4D6), 4, b
#define B4D65                            BANKMASK(B4D6), 5, b
#define B4D66                            BANKMASK(B4D6), 6, b
#define B4D67                            BANKMASK(B4D6), 7, b
#define B4D70                            BANKMASK(B4D7), 0, b
#define B4D71                            BANKMASK(B4D7), 1, b
#define B4D72                            BANKMASK(B4D7), 2, b
#define B4D73                            BANKMASK(B4D7), 3, b
#define B4D74                            BANKMASK(B4D7), 4, b
#define B4D75                            BANKMASK(B4D7), 5, b
#define B4D76                            BANKMASK(B4D7), 6, b
#define B4D77                            BANKMASK(B4D7), 7, b
#define B4DLC0                           BANKMASK(B4DLC), 0, b
#define B4DLC1                           BANKMASK(B4DLC), 1, b
#define B4DLC2                           BANKMASK(B4DLC), 2, b
#define B4DLC3                           BANKMASK(B4DLC), 3, b
#define B4EID0                           BANKMASK(B4EIDL), 0, b
#define B4EID1                           BANKMASK(B4EIDL), 1, b
#define B4EID10                          BANKMASK(B4EIDH), 2, b
#define B4EID11                          BANKMASK(B4EIDH), 3, b
#define B4EID12                          BANKMASK(B4EIDH), 4, b
#define B4EID13                          BANKMASK(B4EIDH), 5, b
#define B4EID14                          BANKMASK(B4EIDH), 6, b
#define B4EID15                          BANKMASK(B4EIDH), 7, b
#define B4EID16                          BANKMASK(B4SIDL), 0, b
#define B4EID17                          BANKMASK(B4SIDL), 1, b
#define B4EID2                           BANKMASK(B4EIDL), 2, b
#define B4EID3                           BANKMASK(B4EIDL), 3, b
#define B4EID4                           BANKMASK(B4EIDL), 4, b
#define B4EID5                           BANKMASK(B4EIDL), 5, b
#define B4EID6                           BANKMASK(B4EIDL), 6, b
#define B4EID7                           BANKMASK(B4EIDL), 7, b
#define B4EID8                           BANKMASK(B4EIDH), 0, b
#define B4EID9                           BANKMASK(B4EIDH), 1, b
#define B4EXID                           BANKMASK(B4SIDL), 3, b
#define B4EXIDE                          BANKMASK(B4SIDL), 3, b
#define B4FILHIT0                        BANKMASK(B4CON), 0, b
#define B4FILHIT1                        BANKMASK(B4CON), 1, b
#define B4FILHIT2                        BANKMASK(B4CON), 2, b
#define B4FILHIT3                        BANKMASK(B4CON), 3, b
#define B4FILHIT4                        BANKMASK(B4CON), 4, b
#define B4IE                             BANKMASK(BIE0), 6, b
#define B4RB0                            BANKMASK(B4DLC), 4, b
#define B4RB1                            BANKMASK(B4DLC), 5, b
#define B4RTREN                          BANKMASK(B4CON), 2, b
#define B4RTRRO                          BANKMASK(B4CON), 5, b
#define B4RXFUL                          BANKMASK(B4CON), 7, b
#define B4RXM1                           BANKMASK(B4CON), 6, b
#define B4RXRTR                          BANKMASK(B4DLC), 6, b
#define B4SID0                           BANKMASK(B4SIDL), 5, b
#define B4SID1                           BANKMASK(B4SIDL), 6, b
#define B4SID10                          BANKMASK(B4SIDH), 7, b
#define B4SID2                           BANKMASK(B4SIDL), 7, b
#define B4SID3                           BANKMASK(B4SIDH), 0, b
#define B4SID4                           BANKMASK(B4SIDH), 1, b
#define B4SID5                           BANKMASK(B4SIDH), 2, b
#define B4SID6                           BANKMASK(B4SIDH), 3, b
#define B4SID7                           BANKMASK(B4SIDH), 4, b
#define B4SID8                           BANKMASK(B4SIDH), 5, b
#define B4SID9                           BANKMASK(B4SIDH), 6, b
#define B4SRR                            BANKMASK(B4SIDL), 4, b
#define B4TXABT                          BANKMASK(B4CON), 6, b
#define B4TXB3IF                         BANKMASK(B4CON), 7, b
#define B4TXEN                           BANKMASK(BSEL0), 6, b
#define B4TXERR                          BANKMASK(B4CON), 4, b
#define B4TXLARB                         BANKMASK(B4CON), 5, b
#define B4TXPRI0                         BANKMASK(B4CON), 0, b
#define B4TXPRI1                         BANKMASK(B4CON), 1, b
#define B4TXREQ                          BANKMASK(B4CON), 3, b
#define B57D07                           BANKMASK(B5D0), 7, b
#define B57D23                           BANKMASK(B5D2), 3, b
#define B5D00                            BANKMASK(B5D0), 0, b
#define B5D01                            BANKMASK(B5D0), 1, b
#define B5D02                            BANKMASK(B5D0), 2, b
#define B5D03                            BANKMASK(B5D0), 3, b
#define B5D04                            BANKMASK(B5D0), 4, b
#define B5D05                            BANKMASK(B5D0), 5, b
#define B5D06                            BANKMASK(B5D0), 6, b
#define B5D07                            BANKMASK(B5D0), 7, b
#define B5D10                            BANKMASK(B5D1), 0, b
#define B5D11                            BANKMASK(B5D1), 1, b
#define B5D12                            BANKMASK(B5D1), 2, b
#define B5D13                            BANKMASK(B5D1), 3, b
#define B5D14                            BANKMASK(B5D1), 4, b
#define B5D15                            BANKMASK(B5D1), 5, b
#define B5D16                            BANKMASK(B5D1), 6, b
#define B5D17                            BANKMASK(B5D1), 7, b
#define B5D20                            BANKMASK(B5D2), 0, b
#define B5D21                            BANKMASK(B5D2), 1, b
#define B5D22                            BANKMASK(B5D2), 2, b
#define B5D23                            BANKMASK(B5D2), 3, b
#define B5D24                            BANKMASK(B5D2), 4, b
#define B5D25                            BANKMASK(B5D2), 5, b
#define B5D26                            BANKMASK(B5D2), 6, b
#define B5D27                            BANKMASK(B5D2), 7, b
#define B5D30                            BANKMASK(B5D3), 0, b
#define B5D31                            BANKMASK(B5D3), 1, b
#define B5D32                            BANKMASK(B5D3), 2, b
#define B5D33                            BANKMASK(B5D3), 3, b
#define B5D34                            BANKMASK(B5D3), 4, b
#define B5D35                            BANKMASK(B5D3), 5, b
#define B5D36                            BANKMASK(B5D3), 6, b
#define B5D37                            BANKMASK(B5D3), 7, b
#define B5D40                            BANKMASK(B5D4), 0, b
#define B5D41                            BANKMASK(B5D4), 1, b
#define B5D42                            BANKMASK(B5D4), 2, b
#define B5D43                            BANKMASK(B5D4), 3, b
#define B5D44                            BANKMASK(B5D4), 4, b
#define B5D45                            BANKMASK(B5D4), 5, b
#define B5D46                            BANKMASK(B5D4), 6, b
#define B5D47                            BANKMASK(B5D4), 7, b
#define B5D50                            BANKMASK(B5D5), 0, b
#define B5D51                            BANKMASK(B5D5), 1, b
#define B5D52                            BANKMASK(B5D5), 2, b
#define B5D53                            BANKMASK(B5D5), 3, b
#define B5D54                            BANKMASK(B5D5), 4, b
#define B5D55                            BANKMASK(B5D5), 5, b
#define B5D56                            BANKMASK(B5D5), 6, b
#define B5D57                            BANKMASK(B5D5), 7, b
#define B5D60                            BANKMASK(B5D6), 0, b
#define B5D61                            BANKMASK(B5D6), 1, b
#define B5D62                            BANKMASK(B5D6), 2, b
#define B5D63                            BANKMASK(B5D6), 3, b
#define B5D64                            BANKMASK(B5D6), 4, b
#define B5D65                            BANKMASK(B5D6), 5, b
#define B5D66                            BANKMASK(B5D6), 6, b
#define B5D67                            BANKMASK(B5D6), 7, b
#define B5D70                            BANKMASK(B5D7), 0, b
#define B5D71                            BANKMASK(B5D7), 1, b
#define B5D72                            BANKMASK(B5D7), 2, b
#define B5D73                            BANKMASK(B5D7), 3, b
#define B5D74                            BANKMASK(B5D7), 4, b
#define B5D75                            BANKMASK(B5D7), 5, b
#define B5D76                            BANKMASK(B5D7), 6, b
#define B5D77                            BANKMASK(B5D7), 7, b
#define B5DLC0                           BANKMASK(B5DLC), 0, b
#define B5DLC1                           BANKMASK(B5DLC), 1, b
#define B5DLC2                           BANKMASK(B5DLC), 2, b
#define B5DLC3                           BANKMASK(B5DLC), 3, b
#define B5EID0                           BANKMASK(B5EIDL), 0, b
#define B5EID1                           BANKMASK(B5EIDL), 1, b
#define B5EID10                          BANKMASK(B5EIDH), 2, b
#define B5EID11                          BANKMASK(B5EIDH), 3, b
#define B5EID12                          BANKMASK(B5EIDH), 4, b
#define B5EID13                          BANKMASK(B5EIDH), 5, b
#define B5EID14                          BANKMASK(B5EIDH), 6, b
#define B5EID15                          BANKMASK(B5EIDH), 7, b
#define B5EID16                          BANKMASK(B5SIDL), 0, b
#define B5EID17                          BANKMASK(B5SIDL), 1, b
#define B5EID2                           BANKMASK(B5EIDL), 2, b
#define B5EID3                           BANKMASK(B5EIDL), 3, b
#define B5EID4                           BANKMASK(B5EIDL), 4, b
#define B5EID5                           BANKMASK(B5EIDL), 5, b
